"""
1) Создать текстовый txt-файл.
2) Вставить туда англоязычную статью из Википедии.
3) Написать функцию со следующим функционалом:
3.1) Прочитать файл построчно, вывести на печать.
3.2) Создать список и добавить туда непустые строки.
3.3) В строках оставить только латинские буквы и пробелы. Прочие символы удалить.
3.4) Объединить список в единую строку. вывести на печать.
3.5) Подсчитать количество вхождений различных слов в тескте. Подсчет вести в словаре.
3.6) Вывести на печать 10 наиболее популярных и наименее популярных слов (“ 1) -- hello -- 15”).
3.7) Заменить наименее популярные слова на “PYTHON”.
3.8) Создать новый txt-файл.
3.9) Записать текст в файл, разбивая на строки, при этом на каждой строке записывать не более 100 символов и не делить слова.
"""

def wiki_function():
    # Тело функции
    return 1


# Вызов функции
wiki_function()